Motivation/Inspiration
    - We are what we repeatedly do. Excellence then, is not an act, but a habit. - Aristotle
    - He who works with his hands is a laborer. He who works with his hands and his head is a craftsman. He who works with his hands and his head and his heart is an artist. - Louis Nizer
    - I am a great believer in luck, and I find the harder I work, the more I have of it. - Thomas Jefferson
    - When you come to a fork in the road, take it. - Yogi Berra
    - Far better is it to dare mighty things, to win glorious triumphs, even though checkered by failure... than to rank with those poor spirits who neither enjoy nor suffer much, because they live in a gray twilight that knows not victory nor defeat. -Teddy Roosevelt
    - Your words become your actions, Your actions become your habits, Your habits become … your destiny. - Mahatma Ghandi
    - There are no secrets to success. It is the result of preparation, hard work, and learning from failure. - Colin Powell
- Advice
    - Don't light yourself on fire to keep someone else warm
- Beautiful explanations
    - If you can’t explain it simply, you don’t understand it well enough. - Albert Einstein
    - Those who surrender freedom for security will not have, nor do they deserve, either one. - Benjamin Franklin
    - Better to remain silent and be thought a fool than to speak out and remove all doubt. - Abraham Lincoln
    - When art critics get together they talk about Form and Structure and Meaning. When artists get together they talk about where you can buy cheap turpentine - Pablo Picasso
    - If you run into an asshole in the morning, you ran into an asshole. If you run into assholes all day, you’re the asshole. - Raylan Givens
    - Take the risk of thinking for yourself, much more happiness, truth, beauty, and wisdom will come to you that way. - Christopher Hitchens
    - What can be asserted without evidence can be dismissed without evidence. - Christopher Hitchens
    - The only time you look in your neighbor's bowl is to make sure that they have enough. You don't look in your neighbor's bowl to see if you have as much as them. - Louis C.K.
- Education
    - The illiterate of the 21st century will not be those who cannot read and write, but those who cannot learn, unlearn, and relearn.  - Alvin Toffler
    - It has been said that man is a rational animal. All my life I have been searching for evidence which could support this. Bertrand Russell
    - The time you enjoy wasting is not wasted time. Bertrand Russell
    - Men are born ignorant, not stupid. They are made stupid by education. Bertrand Russell
    - If you think education is expensive, try the cost of ignorance. - Derek Bok - former president of Harvard University
    - Nothing in the world is more dangerous than sincere ignorance and conscientious stupidity. - Martin Luther King Jr.
    - The function of education is to teach one to think intensively and to think critically. Intelligence plus character - that is the goal of true education. - Martin Luther King Jr.
    - One of the saddest lessons of history is this: If we’ve been bamboozled long enough, we tend to reject any evidence of the bamboozle. We’re no longer interested in finding out the truth. The bamboozle has captured us. It’s simply too painful to acknowledge, even to ourselves, that we’ve been taken. Once you give a charlatan power over you, you almost never get it back. - Carl Sagan
    - What an astonishing thing a book is. It's a flat object made from a tree with flexible parts on which are imprinted lots of funny dark squiggles. But one glance at it and you're inside the mind of another person, maybe somebody dead for thousands of years. Across the millennia, an author is speaking clearly and silently inside your head, directly to you. Writing is perhaps the greatest of human inventions, binding together people who never knew each other, citizens of distant epochs. Books break the shackles of time. A book is proof that humans are capable of working magic. - Carl Sagan
- Math/Science
    - An expert is a man who has made all the mistakes which can be made, in a narrow field. - Niels Bohr
    - In mathematics you don't understand things. You just get used to them. - John von Neumann
    - It can be of no practical use to know that Pi is irrational, but if we can know, it surely would be intolerable not to know. - E.C.Titchmarsh
    - I fear the day technology will surpass our human interaction. The world will have a generation of idiots. ― Albert Einstein
    - The Feynman Algorithm:
        - Write down the problem.
        - Think real hard.
        - Write down the solution.
        - The Feynman algorithm was facetiously suggested by Murray Gell-Mann, a colleague of Feynman, in a New York Times interview.
    - The game I play is a very interesting one, it’s imagination in a tight straitjacket. - Richard Feynman
- Politics
    - Anti-intellectualism has been a constant thread winding its way through our political and cultural life, nurtured by the false notion that democracy means that 'my ignorance is just as good as your knowledge.' - Isaac Asimov
    - The whole problem with the world is that fools and fanatics are always so certain of themselves, and wiser people so full of doubts. - Bertrand Russell
    - The Constitution is not an instrument for the government to restrain the people, it is an instrument for the people to restrain the government - lest it come to dominate our lives and interests. - Patrick Henry
    - Arguing that you don’t care about the right to privacy because you have nothing to hide is no different than saying you don’t care about free speech because you have nothing to say." - Edward Snowden
        - https://www.reddit.com/r/IAmA/comments/36ru89/just_days_left_to_kill_mass_surveillance_under/crglgh2
- Governemnt/Society
    - A society will be judged on the basis of how it treats its weakest members - Pope John Paul II
    - War does not determine who is right - only who is left. Bertrand Russell
- Religon
    - How is it that hardly any major religion has looked at science and concluded, “This is better than we thought! The Universe is much bigger than our prophets said, grander, more subtle, more elegant?” Instead they say, “No, no, no! My god is a little god, and I want him to stay that way.” A religion, old or new, that stressed the magnificence of the Universe as revealed by modern science might be able to draw forth reserves of reverence and awe hardly tapped by the conventional faiths. - Carl Sagan
- Finance
    - Rule No.1: Never lose money. Rule No.2: Never forget rule No.1. - Warren Buffett
    - OCTOBER: This is one of the peculiarly dangerous months to speculate in stocks. The others are July, January, September, April, November, May, March, June, December, August, and February. - Mark Twain
    - Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires. - John Steinbeck
    - It is no measure of health to be well adjusted to a profoundly sick society. - Jiddu Krishnamurti
- Funny
    - The pessimist says "man, this can't get any worse." and the optimist responds "yes, it can."
    - I spent half my money on gambling, alcohol and wild women. The other half I wasted. - W.C. Fields
- Technology
    - Any sufficiently advanced technology is indistinguishable from magic - Arthur C. Clarke
- Other
    - People have a hard time letting go of their suffering. Out of a fear of the unknown, they prefer suffering that is familiar. - Thich Nhat Hanh
    - No man is an island, entire of itself...any man's death diminishes me, because I am involved in mankind; and therefore never send to know for whom the bell tolls; it tolls for thee. - from Meditation 17 by John Donne
    - Being deeply loved by someone gives you strength, while loving someone deeply gives you courage… – Lao Tzu
    - The best swordsman in the world doesn't need to fear the second best swordsman in the world; no, the person for him to be afraid of is some ignorant antagonist who has never had a sword in his hand before; he doesn't do the thing he ought to do, and so the expert isn't prepared for him; he does the thing he ought not to do; and often it catches the expert out and ends him on the spot. - Mark Twain
    - “...it's like this. Sometimes, when you've a very long street ahead of you, you think how terribly long it is and feel sure you'll never get it swept. And then you start to hurry. You work faster and faster and every time you look up there seems to be just as much left to sweep as before, and you try even harder, and you panic, and in the end you're out of breath and have to stop--and still the street stretches away in front of you. That's not the way to do it. You must never think of the whole street at once, understand? You must only concentrate on the next step, the next breath, the next stroke of the broom, and the next, and the next. Nothing else. That way you enjoy your work, which is important, because then you make a good job of it. And that's how it ought to be.  And all at once, before you know it, you find you've swept the whole street clean, bit by bit. what's more, you aren't out of breath. That's important, too... (28-29)” ― Michael Ende, Momo
- Software:
    - The size of the budget determines the size of the solution, not the other way round.
    - Explanation of different programming languages
        - http://www.quora.com/In-laymans-terms-what-are-the-major-programming-languages-and-what-are-they-used-for/answer/Justin-Thomas?srid=uX1c&share=1
    - Know your queries before you NoSQL - @BigDataBorat
        - https://twitter.com/BigDataBorat/status/427962958694453248
    - There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies and the other way is to make it so complicated that there are no obvious deficiencies. - C.A.R. Hoare, The 1980 ACM Turing Award Lecture
    - There are two ways to write error-free programs; only the third one works. - Alan J. Perlis (Yale professor and first recipient of the Turing Award)
    - Some companies see their employees as orange trees that they need to keep healthy year after year. Some companies see their employees as oranges they need to squeeze as much as possible.
    - Some people, when confronted with a problem, think "I know, I'll use regular expressions." Now they have two problems. - Jamie Zawinski
    - I can deliver your project quickly, cheaply and of good quality - pick two
        - Good/Fast/Cheap - http://www.pyragraph.com/wp-content/uploads/2013/04/GOOD-FAST-CHEAP.jpg
        - Time/Cost/Scope-Quality - http://4.bp.blogspot.com/_bInnDDjGM24/SlVMRBtEOEI/AAAAAAAAFu4/jwyCF3ywab0/s400/scope.gif
    - Anyone who slaps a ‘this page is best viewed with Browser X’ label on a Web page appears to be yearning for the bad old days, before the Web, when you had very little chance of reading a document written on another computer, another word processor, or another network. – Tim Berners-Lee (in Technology Review, July 1996)
    - Measuring programming progress by lines of code is like measuring aircraft building progress by weight. - Bill Gates
    - I thought using loops was cheating, so I programmed my own using samples. I then thought using samples was cheating, so I recorded real drums. I then thought that programming it was cheating, so I learned to play drums for real. I then thought using bought drums was cheating, so I learned to make my own. I then thought using premade skins was cheating, so I killed a goat and skinned it. I then thought that that was cheating too, so I grew my own goat from a baby goat. I also think that is cheating, but I’m not sure where to go from here. I haven’t made any music lately, what with the goat farming and all.
        - https://news.ycombinator.com/item?id=11065769
- Zen Quotes
    - Thousands of candles can be lit from a single candle, and the life of the candle will not be shortened. Happiness never decreases by being shared. - Buddha
    - An idea that is developed and put into action is more important than an idea that exists only as an idea. - Buddha
    - A jug fills drop by drop. - Buddha
    - Before Enlightenment, chop wood carry water. After Enlightenment, chop wood carry water.
    - You will not be punished for your anger, you will be punished by your anger. - Buddha
    - Three things cannot be long hidden: the sun, the moon, and the truth. - Buddha
    - Believe nothing, no matter where you read it, or who said it, no matter if I have said it, unless it agrees with your own reason and your own common sense. - Buddha
    - Even death is not to be feared by one who has lived wisely. - Buddha
    - A dog is not considered a good dog because he is a good barker. A man is not considered a good man because he is a good talker. - Buddha
    - Have compassion for all beings, rich and poor alike; each has their suffering. Some suffer too much, others too little. - Buddha
    - Do not dwell in the past, do not dream of the future, concentrate the mind on the present moment. - Buddha
    - In the beginner’s mind there are many possibilities, but in the expert’s there are few ― Shunryu Suzuki, Zen Mind, Beginner's Mind: Informal Talks on Zen Meditation and Practice
    - If you are unable to find the truth right where you are, where else do you expect to find it? ― Dōgen
